package chatBot;


public class PhrasesBot {
	
	public static String[] s_questions = {
			"Как тебя зовут?",
			"Как погода за окном?",
			"Как у тебя настроение?",
			"Что ты любишь?",
			"Сколько тебе лет?",
			"Как часто ты грустишь?",
			"Что ты ненавидишь делать?",
			"Меня давно интересовал вопрос, что такое ОПП?",
			"Сколько времени на часах?",
			"Расскажи о твоём хобби",
			"Почему не спишь?",
			"Каких животных ты любишь?",
			"Как любишь проводить выходные?",
			"Что делал на каникулах?",
			"В чём ты спишь?",
			"Ты оптимист, пессимист или может быть реалист?",
			"Какие у тебя увлечения?",
			"Какой самый счастливый момент в твоей жизни?",
			"Какую музыку слушаешь последнее время?",
			"Скажи, а какое твоё любимое время года?",
			"Какая твоя любимая книга?"
	};
	
	public static String[] s_phrases = {
			"Оо, как интересно!",
			"Замечательно!",
			"Удивительно!", 
			"Просто чудесно!", 
			"Великолепно!",
			"Весьма впечатляет!",
			"Ты меня удивил!", 
			"Я ошарашен!", 
			"Весьма не дурно...",
			"Это серьёзно...",
			"Идеально!",
			"Круто!",
			"Любопытно однако:)",
			"Потрясающе!", 
			"Смешно, ха-ха:)",
			"Хорошо!",
			"Ясно.",
			"Чертовски остроумно!"
	};
	
    public String s_aboutMe = "Я бот Евлампий, призванный играть с тобой:))\n"
			+ "Пиши мне в любое время: \"помощь\"\n"
			+ "и я напомню как со мной общаться.\n\n"
			+ "Я предлагаю тебе на выбор разные игры,\n"
			+ "а твоя задача выбрать игру и наслаждаться:))\n\n"
			+ "Поиграем? \n\n "
			+ "Пиши: \n" 
			+ "\"да\" - чтобы выбрать игру и начать играть, \n"
			+ "\"нет\" - чтобы отказаться от игры и начать диалог, \n"
			+ "\"ещё\" - чтобы поиграть ещё, \n"
			+ "\"устал\" - чтобы поменять вид взаимодействия со мной, \n"
			+ "\"пока\" - чтобы попрощаться со мной :( \n";
}
